# print('----------------------------')
# print('오늘에 대한 정보입니다')
# print('----------------------------')
# print('----------------------------\n오늘에 대한 정보 입니다. \n----------------------------\n')
printdata='''
------------------------------------------
오늘에 대한 정보입니다.
------------------------------------------
'''
print(printdata)

# weather = input('오늘의 날씨는?')
# degree = input('오늘의 온도는?')
# schedule = input('오늘의 저녁 스케쥴?')

weather,degree,schedule  = input('날씨, 온도는, 저녁 스케쥴?>>').split(',')

print('----------------------------')
print('오늘은 ' , weather , "하고, " , float(degree)-1 , "도 이고," , schedule , "에 머무를 예정 입니다")